# 3. Напишите программу,
# в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

text = input("Введите текст:\n")
frag = input("Введите искомый фрагмент:\n")
print(text.count(frag))